Autodesk.Revit.DB.RoutingPreferenceErrorLevel
Since:
2013
An enumerated type listing the options for posting errors or warnings when routing preferences are not satisfied.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceErrorLevel.Error
Post Revit errors if there is no rule in the routing preference satisfying the current condition.

Autodesk.Revit.DB.RoutingPreferenceErrorLevel.Warning
Post Revit warnings if there is no rule in the routing preference satisfying the current condition.

Autodesk.Revit.DB.RoutingPreferenceErrorLevel.None
Do not post any warning or error if there is no rule in the routing preference satisfying the current condition.